# Здесь список из кортежей - каждый элемент хранит координаты каких-то объектов.
import turtle

hole_list_upper_left = [(-63.0, 274.0), (-254.0, 200.0), (-191.0, 211.0), (-219.0, 169.0), (-259.0, 133.0), (-222.0, 113.0),
             (-255.0, 56.0)]

hole_list_bottom_left = [(-33.0, 305.0),
(-332.0, -99.0),
(-317.0, -8.0),
(-299.0, -54.0),
(-259.0, -26.0),
(-267.0, -92.0),
 (-228.0, -59.0),
 (-219.0, -118.0),
 (-168.0, -69.0),
 (-164.0, -135.0),
 (-115.0, -93.0),
 (-97.0, -161.0),
 (-70.0, -125.0),
 (-21.0, -117.0)]


hole_list_right = [(-5.0, 54.0), (67.0, 89.0), (116.0, 90.0)]


class Hole(turtle.Turtle):
    def __init__(self, x, y, color):
        super(Hole, self).__init__()
        self.penup()
        self.setposition(x, y)
        self.shape("circle")
        self.color(color)


